In [1]:
import pandas as pd

In [2]:
df = pd.read_excel('library.xlsx')
df['course'] = df['course'].str.lower()
df = df.reset_index()
df.shape

(21732, 4)

In [5]:
req = pd.read_excel('req.xlsx')
req.desc = req.desc.str.lower()
req = req.reset_index()
req.shape

(126, 9)

In [6]:
def clean(text):
    text = text.replace('!', '')
    text = text.replace('@', '')
    text = text.replace('#', '')
    text = text.replace('%', '')
    text = text.replace('^', '')
    text = text.replace('&', '')
    text = text.replace('*', '')
    text = text.replace('(', '')
    text = text.replace(')', '')
    text = text.replace('-', '')
    text = text.replace('+', '')
    text = text.replace(',', '')
    text = text.replace('.', '')
    text = text.replace('"', '')
    text = text.replace("'", '')
    text = text.replace(":", '')
    return text
clean('h%Ybr4.(((,<>')

'hYbr4<>'

In [305]:
def remove_stop_words(arr):
    w = ['a', 'in', 'and', 'or', 'on', 'of', 'the', 'is', '', ' ', 'fundamental' ]
    for i in w:
        try:
            arr.remove(i)
        except:
            pass
    return arr

In [306]:
def remove_s(text):
    if len(text) > 0:
        if text[-1] == 's':
            text = text[:-1]
    return text

In [335]:
def mapping(req, df):
    output = pd.DataFrame()
    counter = 1
    
    
    for i in req.index:
        print(i+1 ,'/', req.shape[0])
        word = clean(req['desc'].iloc[i])
        word_list = word.split(' ')
        word_list = remove_stop_words(word_list)
        word_list_len = len(word_list)
        match = pd.DataFrame(columns={'ID', 'Name ', 'Sector', 'GD', 'Grade','desc',  'score', 'platform', 'link' })
        
        for u in range(len(word_list)):
            word_list[u] = remove_s(word_list[u])

        for j in df.index:
            score = 0
            name = clean(df['name'].iloc[j])
            name_list = name.split(' ')
            name_list = remove_stop_words(name_list)
            name_list_len = len(name_list)
            
            for u in range(len(name_list)):
                name_list[u] = remove_s(name_list[u])
            
            for k in range(len(word_list)):
                if word_list[k].strip() in name_list:
                    score = score + 1
            # loop word_list
         
            if name_list_len == 1:
                w1 = score / word_list_len
                w2 = 0
                w3 = 0
                w4 = 0
            else:
                try:    
                    w2 = score / name_list_len  
                except:
                    w2 = 0
                
                if (name_list_len - word_list_len) > score:
                    w1 = 1-(name_list_len-word_list_len)/100
                else:
                    w1 = (name_list_len-word_list_len)/100+1
                    
                if (name_list_len > word_list_len):
                    w4 = word_list_len / name_list_len
                else:
                    w4 = score / name_list_len
                    
                w3 = score / word_list_len
                
                W1 = ((w2*0.2)+(w1*0.2)+(w3*0.5)+(w4*0.1))
                W2 = ((w2*0.1)+(w1*0.1)+(w3*0.5)+(w4*0.2))
                
                if W1 > W2:
                    w = W1
                else:
                    w = W1
            score = w
            if (word_list_len == 2 and score > 0.45) \
            or (word_list_len == 3 and score > 0.35) \
            or (word_list_len == 4 and score > 0.25) \
            or (word_list_len == 5 and score >= 0.6) \
            or  (word_list_len > 5 and score >= 0.4): \
                match = match.append({'w': w1,'w2': w2,'w3': w3,'w4': w4,'ID': req['ID'].iloc[i], 'Name ': req['Name '].iloc[i], 'Sector': req.Sector.iloc[i], 'GD': req.GD.iloc[i], 'Grade': req.Grade.iloc[i],'desc': req['desc'].iloc[i],'course': df['name'].iloc[j], 'score': score, 'platform':df.platform.iloc[j], 'link':df.link.iloc[j] }, ignore_index=True)
                #print(score, name_list, word_list)
        # loop df
        if len(match) > 0:
            match = match.sort_values(by=['score', 'w'], ascending=False)
            #display(match[['desc', 'course', 'score', 'w']])
            match = match.head(1)
            output = output.append(match)
            
        else:
            match = match.append({'ID': req['ID'].iloc[i], 'Name ': req['Name '].iloc[i], 'Sector': req.Sector.iloc[i], 'GD': req.GD.iloc[i], 'Grade': req.Grade.iloc[i],'desc':req['desc'].iloc[i],'course': 'NA', 'score': 'NA', 'platform':'NA', 'link':'NA' }, ignore_index=True)
            output = output.append(match)
        display(output[['desc', 'course', 'score']].tail(1))
        print('---------------------------------------')
    # loop req
    return output
o=mapping(req, df)

1 / 126

                 desc             course  score
4   talent enablement  talent management    0.6

---------------------------------------
2 / 126

,desc,course,score
2,pmi agile certified practitioner course,testprep: pmi agile certified practitioner,0.84

---------------------------------------
3 / 126

                          desc              course  score
30   devops fundamental course  devops foundations    0.6

---------------------------------------
4 / 126

,desc,course,score
25,big data processing and mining practice high l...,big data integration and processing,0.6045

---------------------------------------
5 / 126

                 desc                          course  score
224   digital mindset  expanding your digital mindset  0.854

---------------------------------------
6 / 126

,desc,course,score
8,develop knowledge of change management princip...,change management foundations,0.534857

---------------------------------------
7 / 126

,desc,course,score
410,office management skills,management skills for international business,0.677333

---------------------------------------
8 / 126

,desc,course,score
3,certificate of red hat certified specialist in...,cert prep: red hat certified system engineer (...,0.578786

---------------------------------------
9 / 126

,desc,course,score
7842,architecture frameworks and best practices.,policies and best practices,0.648

---------------------------------------
10 / 126

                 desc                                    course  score
69  training on cloud  google cloud platform essential training  0.814

---------------------------------------
11 / 126

,desc,course,score
23,quality management and assurance,quality management foundations,0.733333

---------------------------------------
12 / 126

                 desc                          course  score
224   digital mindset  expanding your digital mindset  0.854

---------------------------------------
13 / 126

                  desc                      course  score
109   business acumens  developing business acumen  0.902

---------------------------------------
14 / 126

                  desc                      course  score
109   business acumens  developing business acumen  0.902

---------------------------------------
15 / 126

                                                desc course score
0  several audio educative sessions across oss an...     NA    NA

---------------------------------------
16 / 126

,desc,course,score
23,quality management and assurance,quality management foundations,0.733333

---------------------------------------
17 / 126

                      desc                                course  score
131  innovation leadership  leadership through design innovation  0.854

---------------------------------------
18 / 126

,desc,course,score
39,effective communication and proactive and lea...,effective team communication,0.560667

---------------------------------------
19 / 126

,desc,course,score
0,software licensing & license management in fle...,software testing: tools,0.560667

---------------------------------------
20 / 126

                 desc             course score
14  critical thinking  critical thinking   1.0

---------------------------------------
21 / 126

,desc,course,score
705,effectively leading digital transformation,effectively leading digital transformation,1.0

---------------------------------------
22 / 126

            desc                        course     score
6   ea framework  learning security frameworks  0.585333

---------------------------------------
23 / 126

                      desc                   course     score
97   data analytics domain  learning data analytics  0.733333

---------------------------------------
24 / 126

                             desc                      course     score
134   leadership business acumen.  developing business acumen  0.733333

---------------------------------------
25 / 126

                   desc              course score
15   strategic thinking  strategic thinking   1.0

---------------------------------------
26 / 126

                desc                               course     score
3   grc & compliance  gdpr compliance: essential training  0.493667

---------------------------------------
27 / 126

             desc                    course     score
5  english course  writing in plain english  0.585333

---------------------------------------
28 / 126

                               desc                   course  score
330   basic cloud design techniques  logo design: techniques  0.648

---------------------------------------
29 / 126

                                   desc                        course  score
1439  core - new development activities  ios app development: core ml  0.612

---------------------------------------
30 / 126

                                  desc course score
0   business analysis from pmi or cbap     NA    NA

---------------------------------------
31 / 126

,desc,course,score
281,advanced process mining,advanced manufacturing process analysis,0.710333

---------------------------------------
32 / 126

                 desc                      course  score
109   business acumen  developing business acumen  0.902

---------------------------------------
33 / 126

                  desc                      course  score
109   business acumens  developing business acumen  0.902

---------------------------------------
34 / 126

,desc,course,score
281,advanced process mining,advanced manufacturing process analysis,0.710333

---------------------------------------
35 / 126

                                  desc course score
0   business analysis from pmi or cbap     NA    NA

---------------------------------------
36 / 126

,desc,course,score
1547,measuring process and organizational performance,measuring team performance,0.648

---------------------------------------
37 / 126

,desc,course,score
27,enhance data analysis skills for functional c...,learning haskell for data analysis,0.590286

---------------------------------------
38 / 126

          desc course score
0   networking     NA    NA

---------------------------------------
39 / 126

,desc,course,score
40,"wh infrastructure, security and h&s, managemen...",enterprise and infrastructure security,0.560667

---------------------------------------
40 / 126

,desc,course,score
31,cloud architecture professional,cloud architecture: core concepts,0.710333

---------------------------------------
41 / 126

                          desc                              course  score
823  finance for non-financial  finance for non-financial managers  0.927

---------------------------------------
42 / 126

     desc course score
0  togaf      NA    NA

---------------------------------------
43 / 126

                        desc                        course  score
176  effective communication  effective team communication  0.902

---------------------------------------
44 / 126

,desc,course,score
10,accreditation of auditing certifications.,developer career paths and certifications,0.493667

---------------------------------------
45 / 126

                              desc                 course     score
365   data management and analysis  python: data analysis  0.733333

---------------------------------------
46 / 126

,desc,course,score
1212,develop a collaboration culture and effectiveness,organizational culture,0.471

---------------------------------------
47 / 126

                desc                       course     score
4  p3o certification  certification prep: shrm-cp  0.585333

---------------------------------------
48 / 126

                 desc                       course     score
4  capm certification  certification prep: shrm-cp  0.585333

---------------------------------------
49 / 126

,desc,course,score
1,etom business process management framework,business analysis & process management,0.723

---------------------------------------
50 / 126

                                                desc course score
0  certified manager of quality and organizationa...     NA    NA

---------------------------------------
51 / 126

                             desc course score
0   tmf course around tam or etom     NA    NA

---------------------------------------
52 / 126

                                desc course score
0  iso 9001-2015 lead auditor course     NA    NA

---------------------------------------
53 / 126

                                                desc course score
0   measuring process and organizational performa...     NA    NA

---------------------------------------
54 / 126

                           desc                    course  score
4574  big data technology basic  fundamentals of big data  0.648

---------------------------------------
55 / 126

                                                desc course score
0  documentation, information/ records managem...     NA    NA

---------------------------------------
56 / 126

                desc                          course  score
224  digital mindset  expanding your digital mindset  0.854

---------------------------------------
57 / 126

                        desc             course     score
69  devolve financial acumen  financial markets  0.514667

---------------------------------------
58 / 126

                       desc                               course  score
55   thinking strategically  thinking strategically as a manager  0.854

---------------------------------------
59 / 126

,desc,course,score
25,big data processing and mining practice high l...,big data integration and processing,0.6045

---------------------------------------
60 / 126

,desc,course,score
4,lean six sigma yellow and green belt course,six sigma: green belt,0.779714

---------------------------------------
61 / 126

                                                desc course score
0  measuring process and organizational performan...     NA    NA

---------------------------------------
62 / 126

                desc                          course  score
224  digital mindset  expanding your digital mindset  0.854

---------------------------------------
63 / 126

,desc,course,score
1071,develop strategic & leadership skills,leadership: practical skills,0.648

---------------------------------------
64 / 126

            desc                        course     score
6   ea framework  learning security frameworks  0.585333

---------------------------------------
65 / 126

                    desc                     course score
1  communication courses  high-stakes communication   0.6

---------------------------------------
66 / 126

,desc,course,score
11,governance & centers of excellence advanced,algebra: elementary to advanced - equations & ...,0.511524

---------------------------------------
67 / 126

                                  desc course score
0   business analysis from pmi or cbap     NA    NA

---------------------------------------
68 / 126

                                                desc course score
0  certified manager of quality and organization...     NA    NA

---------------------------------------
69 / 126

,desc,course,score
462,process management skills,business analysis & process management,0.710333

---------------------------------------
70 / 126

                                       desc            course  score
3797   latest cloud networking technologies  cloud networking  0.746

---------------------------------------
71 / 126

                        desc             course     score
76  develop financial acumen  financial markets  0.514667

---------------------------------------
72 / 126

,desc,course,score
4267,agile project/program management methodology.,agile project management,0.648

---------------------------------------
73 / 126

,desc,course,score
166,accreditation of an auditing certification,hiring an employee for managers,0.447

---------------------------------------
74 / 126

                             desc                course  score
4387  finance for none financials  finance for managers  0.648

---------------------------------------
75 / 126

                desc                          course  score
224  digital mindset  expanding your digital mindset  0.854

---------------------------------------
76 / 126

,desc,course,score
3944,digital mindset and emerging technologies.,smart device & mobile emerging technologies,0.612

---------------------------------------
77 / 126

               desc                                    course  score
69   cloud training  google cloud platform essential training  0.814

---------------------------------------
78 / 126

,desc,course,score
10,accreditation of auditing certification,developer career paths and certifications,0.493667

---------------------------------------
79 / 126

                                 desc                   course  score
1029  quality assurance data analysis  ebook quality assurance  0.648

---------------------------------------
80 / 126

,desc,course,score
150,requirements analysis and management.,requirements elicitation and analysis,0.733333

---------------------------------------
81 / 126

                  desc                          course  score
224   digital mindset.  expanding your digital mindset  0.854

---------------------------------------
82 / 126

,desc,course,score
1,""" business analysis or business needs analy...",business development foundations: researching ...,0.511524

---------------------------------------
83 / 126

                        desc                      course score
2479  lean six sigma yellow   lean six sigma foundations   0.8

---------------------------------------
84 / 126

                                desc course score
0  iso 9001-2015 lead auditor course     NA    NA

---------------------------------------
85 / 126

,desc,course,score
876,etom training course,motivational enhancement techniques: working w...,0.538175

---------------------------------------
86 / 126

,desc,course,score
468,advanced program management competencies,program management foundations,0.648

---------------------------------------
87 / 126

,desc,course,score
1212,develop a collaboration culture and effectiveness,organizational culture,0.471

---------------------------------------
88 / 126

                              desc                 course     score
365   data management and analysis  python: data analysis  0.733333

---------------------------------------
89 / 126

                                   desc                        course  score
1439  core - new development activities  ios app development: core ml  0.612

---------------------------------------
90 / 126

,desc,course,score
276,improving digital decisions with machine learning,machine learning with python,0.671

---------------------------------------
91 / 126

                                            desc course score
0  governance & centers of excellence  advanced     NA    NA

---------------------------------------
92 / 126

,desc,course,score
281,advanced process mining,advanced manufacturing process analysis,0.710333

---------------------------------------
93 / 126

                             desc                      course     score
25  technical & executive reports  technical writing: reports  0.733333

---------------------------------------
94 / 126

,desc,course,score
1,etom business process management framework,business analysis & process management,0.723

---------------------------------------
95 / 126

                                   desc                        course  score
1439  core - new development activities  ios app development: core ml  0.612

---------------------------------------
96 / 126

                      desc                      course  score
2   lean six sigma yellow   lean six sigma foundations  0.723

---------------------------------------
97 / 126

                                      desc                    course     score
50   big data  practice high level course.  fundamentals of big data  0.534857

---------------------------------------
98 / 126

                                                desc course score
0  measuring process and organizational performan...     NA    NA

---------------------------------------
99 / 126

,desc,course,score
0,certified business analysis professional (cbap...,studying for the certified business analyst pr...,0.735333

---------------------------------------
100 / 126

                desc                          course  score
224  digital mindset  expanding your digital mindset  0.854

---------------------------------------
101 / 126

                                                desc course score
0  capability of understand technology governance...     NA    NA

---------------------------------------
102 / 126

                                 desc                course     score
385  eliciting requirements creating   requirements writing  0.514667

---------------------------------------
103 / 126

,desc,course,score
281,advanced process mining,advanced manufacturing process analysis,0.710333

---------------------------------------
104 / 126

,desc,course,score
276,improving digital decisions with machine learning,machine learning with python,0.671

---------------------------------------
105 / 126

                desc                          course  score
224  digital mindset  expanding your digital mindset  0.854

---------------------------------------
106 / 126

                                 desc                   course  score
1029  quality assurance data analysis  ebook quality assurance  0.648

---------------------------------------
107 / 126

                  desc                          course  score
13  project management  project management foundations  0.902

---------------------------------------
108 / 126

                  desc                          course  score
13  project management  project management foundations  0.902

---------------------------------------
109 / 126

                                   desc                        course  score
1439  core - new development activities  ios app development: core ml  0.612

---------------------------------------
110 / 126

,desc,course,score
7557,pmi agile certified practitioner,testprep: pmi agile certified practitioner,0.942

---------------------------------------
111 / 126

,desc,course,score
281,advanced process mining,advanced manufacturing process analysis,0.710333

---------------------------------------
112 / 126

                        desc                      course score
2479   lean six sigma yellow  lean six sigma foundations   0.8

---------------------------------------
113 / 126

                      desc                   course     score
97   data analytics domain  learning data analytics  0.733333

---------------------------------------
114 / 126

                                           desc course score
0  conduct data architectural assets assessment     NA    NA

---------------------------------------
115 / 126

                desc                          course  score
224  digital mindset  expanding your digital mindset  0.854

---------------------------------------
116 / 126

                                 desc                   course  score
1029  quality assurance data analysis  ebook quality assurance  0.648

---------------------------------------
117 / 126

                 desc                          course  score
224   digital mindset  expanding your digital mindset  0.854

---------------------------------------
118 / 126

                               desc                   course  score
330   basic cloud design techniques  logo design: techniques  0.648

---------------------------------------
119 / 126

,desc,course,score
118,presentation skills,presentation skills: speechwriting and storyte...,0.854

---------------------------------------
120 / 126

,desc,course,score
4448,market research and consumer behavior,market research and consumer behavior,1.0

---------------------------------------
121 / 126

              desc                                   course  score
14  strategic plan  assessing and improving strategic plans  0.854

---------------------------------------
122 / 126

,desc,course,score
9078,building digital partnership and ecosystems,building a digital ecosystem that supports kid...,0.723857

---------------------------------------
123 / 126

,desc,course,score
9667,cyber security risk management,"cbrops: threat actors, security, & risk manage...",0.745667

---------------------------------------
124 / 126

                                         desc              course  score
1401   develop the strategic thinking skills.  strategic thinking  0.746

---------------------------------------
125 / 126

,desc,course,score
3,"cobit training via stc academy ""on-site class""...",michigan sport-related concussion training cer...,0.439

---------------------------------------
126 / 126

                 desc            course     score
146  comp tia cloud +  cloud networking  0.514667

---------------------------------------

In [336]:
o = o[['ID', 'Name ', 'Sector', 'GD', 'Grade','score','desc', 'course', 'platform', 'link']]
o.to_excel('output7.xlsx', encoding='utf-8-sig', index=False)